; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_5 ?v9 ?v8)
             (pred_4 ?v12 ?v3)
             (pred_2 ?v9 ?v3)
             (pred_7 ?v10 ?v9 )
	     (pred_6 ?v9)
             (pred_8 ?v2)
             (pred_11 ?v12)
             (pred_10 ?v3)
             (pred_1 ?v9)
             (pred_3 ?v12)
             (pred_9 ?v9)
             (pred_12 ))



(:action op_5
:parameters (?v7 ?v1 ?v5 ?v6)
:precondition (and (pred_8 ?v7) (pred_8 ?v1) (pred_11 ?v5) (pred_10 ?v6)
          (pred_5 ?v7 ?v1) (pred_4 ?v5 ?v6)
                   (pred_2 ?v1 ?v6) (pred_6 ?v7) 
                   (pred_1 ?v1) (pred_3 ?v5))
:effect (and  (pred_9 ?v1) (not (pred_1 ?v1))))


(:action op_4
:parameters (?v7 ?v4)
:precondition (and (pred_8 ?v7) (pred_8 ?v4)
               (pred_6 ?v7) (pred_5 ?v7 ?v4) (pred_9 ?v4))
:effect (and (pred_6 ?v4) (not (pred_6 ?v7))))

(:action op_2
:parameters (?v7 ?v5)
:precondition (and (pred_8 ?v7) (pred_11 ?v5) 
                  (pred_6 ?v7) (pred_7 ?v5 ?v7) (pred_12 ))
:effect (and (pred_3 ?v5)
   (not (pred_7 ?v5 ?v7)) (not (pred_12 ))))


(:action op_3
:parameters (?v7 ?v13 ?v11)
:precondition (and (pred_8 ?v7) (pred_11 ?v13) (pred_11 ?v11)
                  (pred_6 ?v7) (pred_3 ?v11) (pred_7 ?v13 ?v7))
:effect (and (pred_3 ?v13) (pred_7 ?v11 ?v7)
        (not (pred_3 ?v11)) (not (pred_7 ?v13 ?v7))))

(:action op_1
:parameters (?v7 ?v5)
:precondition (and (pred_8 ?v7) (pred_11 ?v5) 
                  (pred_6 ?v7) (pred_3 ?v5))
:effect (and (pred_12 ) (pred_7 ?v5 ?v7) (not (pred_3 ?v5)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_15 obj_28 obj_22 obj_21 obj_02 obj_05 obj_25 obj_09 obj_26 obj_03 obj_30 obj_12 obj_18 obj_24 obj_14 obj_16 obj_01 obj_07 obj_17 obj_29 obj_19 obj_20 obj_08 obj_10 obj_06
    obj_31 obj_13 obj_23
    obj_11 obj_27 obj_04
    )

    (:init
       (pred_12)

       (pred_8 obj_15)
       (pred_8 obj_28)
       (pred_8 obj_22)
       (pred_8 obj_21)
       (pred_8 obj_02)
       (pred_8 obj_05)
       (pred_8 obj_25)
       (pred_8 obj_09)
       (pred_8 obj_26)
       (pred_8 obj_03)
       (pred_8 obj_30)
       (pred_8 obj_12)
       (pred_8 obj_18)
       (pred_8 obj_24)
       (pred_8 obj_14)
       (pred_8 obj_16)
       (pred_8 obj_01)
       (pred_8 obj_07)
       (pred_8 obj_17)
       (pred_8 obj_29)
       (pred_8 obj_19)
       (pred_8 obj_20)
       (pred_8 obj_08)
       (pred_8 obj_10)
       (pred_8 obj_06)
       (pred_10 obj_31)
       (pred_10 obj_13)
       (pred_10 obj_23)
       (pred_11 obj_11)
       (pred_11 obj_27)
       (pred_11 obj_04)

       (pred_5 obj_15 obj_05)
       (pred_5 obj_15 obj_28)
       (pred_5 obj_28 obj_25)
       (pred_5 obj_28 obj_22)
       (pred_5 obj_28 obj_15)
       (pred_5 obj_22 obj_09)
       (pred_5 obj_22 obj_21)
       (pred_5 obj_22 obj_28)
       (pred_5 obj_21 obj_26)
       (pred_5 obj_21 obj_02)
       (pred_5 obj_21 obj_22)
       (pred_5 obj_02 obj_03)
       (pred_5 obj_02 obj_21)
       (pred_5 obj_05 obj_30)
       (pred_5 obj_05 obj_25)
       (pred_5 obj_05 obj_15)
       (pred_5 obj_25 obj_12)
       (pred_5 obj_25 obj_09)
       (pred_5 obj_25 obj_28)
       (pred_5 obj_25 obj_05)
       (pred_5 obj_09 obj_18)
       (pred_5 obj_09 obj_26)
       (pred_5 obj_09 obj_22)
       (pred_5 obj_09 obj_25)
       (pred_5 obj_26 obj_24)
       (pred_5 obj_26 obj_03)
       (pred_5 obj_26 obj_21)
       (pred_5 obj_26 obj_09)
       (pred_5 obj_03 obj_14)
       (pred_5 obj_03 obj_02)
       (pred_5 obj_03 obj_26)
       (pred_5 obj_30 obj_16)
       (pred_5 obj_30 obj_12)
       (pred_5 obj_30 obj_05)
       (pred_5 obj_12 obj_01)
       (pred_5 obj_12 obj_18)
       (pred_5 obj_12 obj_25)
       (pred_5 obj_12 obj_30)
       (pred_5 obj_18 obj_07)
       (pred_5 obj_18 obj_24)
       (pred_5 obj_18 obj_09)
       (pred_5 obj_18 obj_12)
       (pred_5 obj_24 obj_17)
       (pred_5 obj_24 obj_14)
       (pred_5 obj_24 obj_26)
       (pred_5 obj_24 obj_18)
       (pred_5 obj_14 obj_29)
       (pred_5 obj_14 obj_03)
       (pred_5 obj_14 obj_24)
       (pred_5 obj_16 obj_19)
       (pred_5 obj_16 obj_01)
       (pred_5 obj_16 obj_30)
       (pred_5 obj_01 obj_20)
       (pred_5 obj_01 obj_07)
       (pred_5 obj_01 obj_12)
       (pred_5 obj_01 obj_16)
       (pred_5 obj_07 obj_08)
       (pred_5 obj_07 obj_17)
       (pred_5 obj_07 obj_18)
       (pred_5 obj_07 obj_01)
       (pred_5 obj_17 obj_10)
       (pred_5 obj_17 obj_29)
       (pred_5 obj_17 obj_24)
       (pred_5 obj_17 obj_07)
       (pred_5 obj_29 obj_06)
       (pred_5 obj_29 obj_14)
       (pred_5 obj_29 obj_17)
       (pred_5 obj_19 obj_20)
       (pred_5 obj_19 obj_16)
       (pred_5 obj_20 obj_08)
       (pred_5 obj_20 obj_01)
       (pred_5 obj_20 obj_19)
       (pred_5 obj_08 obj_10)
       (pred_5 obj_08 obj_07)
       (pred_5 obj_08 obj_20)
       (pred_5 obj_10 obj_06)
       (pred_5 obj_10 obj_17)
       (pred_5 obj_10 obj_08)
       (pred_5 obj_06 obj_29)
       (pred_5 obj_06 obj_10)
       (pred_1 obj_06)
       (pred_1 obj_18)
       (pred_1 obj_30)
       (pred_2  obj_06 obj_31)
       (pred_2  obj_18 obj_13)
       (pred_2  obj_30 obj_23)
       (pred_9 obj_15)
       (pred_9 obj_28)
       (pred_9 obj_22)
       (pred_9 obj_21)
       (pred_9 obj_02)
       (pred_9 obj_05)
       (pred_9 obj_25)
       (pred_9 obj_09)
       (pred_9 obj_26)
       (pred_9 obj_03)
       (pred_9 obj_12)
       (pred_9 obj_24)
       (pred_9 obj_14)
       (pred_9 obj_16)
       (pred_9 obj_01)
       (pred_9 obj_07)
       (pred_9 obj_17)
       (pred_9 obj_29)
       (pred_9 obj_19)
       (pred_9 obj_20)
       (pred_9 obj_08)
       (pred_9 obj_10)

       (pred_4  obj_11 obj_31)
       (pred_4  obj_27 obj_13)
       (pred_4  obj_04 obj_23)
       (pred_7 obj_11 obj_28)
       (pred_7 obj_27 obj_29)
       (pred_7 obj_04 obj_12)
       (pred_6 obj_05)
    )

    (:goal (and
       (pred_7 obj_11 obj_02)
       (pred_7 obj_04 obj_02)
    ))
(:constraints
  (always (not (pred_6 obj_21)))
)
)

; plan
1. (op_4 obj_05 obj_25)
   deleted: (pred_6 obj_05)
   added: (pred_6 obj_25)
   goals met: 0 of 2
2. (op_4 obj_25 obj_12)
   deleted: (pred_6 obj_25)
   added: (pred_6 obj_12)
   goals met: 0 of 2
3. (op_2 obj_12 obj_04)
   deleted: (pred_7 obj_04 obj_12) (pred_12)
   added: (pred_3 obj_04)
   goals met: 0 of 2
4. (op_4 obj_12 obj_25)
   deleted: (pred_6 obj_12)
   added: (pred_6 obj_25)
   goals met: 0 of 2
5. (op_4 obj_25 obj_28)
   deleted: (pred_6 obj_25)
   added: (pred_6 obj_28)
   goals met: 0 of 2
6. (op_4 obj_28 obj_22)
   deleted: (pred_6 obj_28)
   added: (pred_6 obj_22)
   goals met: 0 of 2
7. (op_1 obj_22 obj_04)
   deleted: (pred_3 obj_04)
   added: (pred_12) (pred_7 obj_04 obj_22)
   goals met: 0 of 2
8. (op_4 obj_22 obj_28)
   deleted: (pred_6 obj_22)
   added: (pred_6 obj_28)
   goals met: 0 of 2
9. (op_2 obj_28 obj_11)
   deleted: (pred_7 obj_11 obj_28) (pred_12)
   added: (pred_3 obj_11)
   goals met: 0 of 2
10. (op_4 obj_28 obj_22)
   deleted: (pred_6 obj_28)
   added: (pred_6 obj_22)
   goals met: 0 of 2
11. (op_4 obj_22 obj_09)
   deleted: (pred_6 obj_22)
   added: (pred_6 obj_09)
   goals met: 0 of 2
12. (op_4 obj_09 obj_26)
   deleted: (pred_6 obj_09)
   added: (pred_6 obj_26)
   goals met: 0 of 2
13. (op_4 obj_26 obj_03)
   deleted: (pred_6 obj_26)
   added: (pred_6 obj_03)
   goals met: 0 of 2
14. (op_4 obj_03 obj_02)
   deleted: (pred_6 obj_03)
   added: (pred_6 obj_02)
   goals met: 0 of 2
15. (op_1 obj_02 obj_11)
   deleted: (pred_3 obj_11)
   added: (pred_12) (pred_7 obj_11 obj_02)
   goals met: 1 of 2
16. (op_4 obj_02 obj_03)
   deleted: (pred_6 obj_02)
   added: (pred_6 obj_03)
   goals met: 1 of 2
17. (op_4 obj_03 obj_26)
   deleted: (pred_6 obj_03)
   added: (pred_6 obj_26)
   goals met: 1 of 2
18. (op_4 obj_26 obj_09)
   deleted: (pred_6 obj_26)
   added: (pred_6 obj_09)
   goals met: 1 of 2
19. (op_4 obj_09 obj_22)
   deleted: (pred_6 obj_09)
   added: (pred_6 obj_22)
   goals met: 1 of 2
20. (op_2 obj_22 obj_04)
   deleted: (pred_7 obj_04 obj_22) (pred_12)
   added: (pred_3 obj_04)
   goals met: 1 of 2
21. (op_4 obj_22 obj_09)
   deleted: (pred_6 obj_22)
   added: (pred_6 obj_09)
   goals met: 1 of 2
22. (op_4 obj_09 obj_26)
   deleted: (pred_6 obj_09)
   added: (pred_6 obj_26)
   goals met: 1 of 2
23. (op_4 obj_26 obj_03)
   deleted: (pred_6 obj_26)
   added: (pred_6 obj_03)
   goals met: 1 of 2
24. (op_4 obj_03 obj_02)
   deleted: (pred_6 obj_03)
   added: (pred_6 obj_02)
   goals met: 1 of 2
25. (op_1 obj_02 obj_04)
   deleted: (pred_3 obj_04)
   added: (pred_12) (pred_7 obj_04 obj_02)
   goals met: 2 of 2
